---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.ModelAlreadyCheckedOutByUser
source: html/f744fd44-e1ee-3402-57db-47b6fcaab849.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.ModelAlreadyCheckedOutByUser Property

The Cloud WorkSharing Model is already checked out by the current user.

## Syntax (C#)
```csharp
public static FailureDefinitionId ModelAlreadyCheckedOutByUser { get; }
```